---
kind: method
id: M:Autodesk.Revit.UI.IFCExternalServiceUIData.GetRevitElementIds
source: html/830bbe4d-d38e-786b-f57f-c76a47d33079.htm
---
# Autodesk.Revit.UI.IFCExternalServiceUIData.GetRevitElementIds Method

return the list of revit Element Ids

## Syntax (C#)
```csharp
public IList<ElementId> GetRevitElementIds()
```